In [1]:
import pandas as pd

data = {
    'Roll Number': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ian', 'Julia'],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Female', 'Male', 'Female'],
    'Marks1': [85, 76, 92, 88, 79, 81, 95, 90, 84, 87],
    'Marks2': [78, 82, 91, 83, 77, 85, 89, 92, 80, 86],
    'Marks3': [80, 79, 88, 90, 83, 87, 91, 86, 82, 84]
}

df = pd.DataFrame(data)

print(df)

   Roll Number     Name  Gender  Marks1  Marks2  Marks3
0          101    Alice  Female      85      78      80
1          102      Bob    Male      76      82      79
2          103  Charlie    Male      92      91      88
3          104    David    Male      88      83      90
4          105      Eve  Female      79      77      83
5          106    Frank    Male      81      85      87
6          107    Grace  Female      95      89      91
7          108   Hannah  Female      90      92      86
8          109      Ian    Male      84      80      82
9          110    Julia  Female      87      86      84

In [3]:
df['Total'] = df.iloc[:,3:6].sum(axis=1)
print(df)

   Roll Number     Name  Gender  Marks1  Marks2  Marks3  Total
0          101    Alice  Female      85      78      80    243
1          102      Bob    Male      76      82      79    237
2          103  Charlie    Male      92      91      88    271
3          104    David    Male      88      83      90    261
4          105      Eve  Female      79      77      83    239
5          106    Frank    Male      81      85      87    253
6          107    Grace  Female      95      89      91    275
7          108   Hannah  Female      90      92      86    268
8          109      Ian    Male      84      80      82    246
9          110    Julia  Female      87      86      84    257

In [6]:
lowest_marks1=df['Marks1'].min()
print(lowest_marks1)

76

In [7]:
highest_marks2=df['Marks2'].max()
print(highest_marks2)

92

In [9]:
avg_marks3=df['Marks3'].mean()
print(avg_marks3)

85.0

In [11]:
df['Average']=df.iloc[:,6].divide(3)
print(df)

   Roll Number     Name  Gender  Marks1  Marks2  Marks3  Total    Average
0          101    Alice  Female      85      78      80    243  81.000000
1          102      Bob    Male      76      82      79    237  79.000000
2          103  Charlie    Male      92      91      88    271  90.333333
3          104    David    Male      88      83      90    261  87.000000
4          105      Eve  Female      79      77      83    239  79.666667
5          106    Frank    Male      81      85      87    253  84.333333
6          107    Grace  Female      95      89      91    275  91.666667
7          108   Hannah  Female      90      92      86    268  89.333333
8          109      Ian    Male      84      80      82    246  82.000000
9          110    Julia  Female      87      86      84    257  85.666667

In [16]:
highest_avg = df['Average'].max()
result = df.loc[df['Average'] == highest_avg]
print(result['Name'])

6    Grace
Name: Name, dtype: object

In [29]:
df.describe().loc[['min', '25%', '50%', '75%', 'max']]

     Roll Number  Marks1  Marks2  Marks3   Total    Average  count
min       101.00   76.00   77.00   79.00  237.00  79.000000    1.0
25%       103.25   81.75   80.50   82.25  243.75  81.250000    1.0
50%       105.50   86.00   84.00   85.00  255.00  85.000000    1.0
75%       107.75   89.50   88.25   87.75  266.25  88.750000    1.0
max       110.00   95.00   92.00   91.00  275.00  91.666667    1.0

In [36]:
details = df.apply(lambda x : True
            if x['Marks2'] < 40 else False, axis = 1) 
people_failed = len(details[details == True].index) 
print('Number of people in dataframe who failed : ', 
      people_failed )

Number of people in dataframe who failed :  0

In [38]:
print(df)

   Roll Number     Name  Gender  Marks1  Marks2  Marks3  Total    Average
0          101    Alice  Female      85      78      80    243  81.000000
1          102      Bob    Male      76      82      79    237  79.000000
2          103  Charlie    Male      92      91      88    271  90.333333
3          104    David    Male      88      83      90    261  87.000000
4          105      Eve  Female      79      77      83    239  79.666667
5          106    Frank    Male      81      85      87    253  84.333333
6          107    Grace  Female      95      89      91    275  91.666667
7          108   Hannah  Female      90      92      86    268  89.333333
8          109      Ian    Male      84      80      82    246  82.000000
9          110    Julia  Female      87      86      84    257  85.666667